$(document).ready(() => {
	const MAX_ITEMS_COUNT = 7; // максимально количество отображаемых пунктов в меню
	//const MAX_ITEMS_COUNTTALRASHA = 300; // максимально количество отображаемых пунктов в меню
	const MAX_ITEMS_COUNTTALRASHA = 13; // максимально количество отображаемых пунктов в меню
	window.currentMenu = null;
	const ITEM_HEIGHT = 4;
	//const ITEM_HEIGHTTALRASHA = 124;
	const ITEM_HEIGHTTALRASHA = 124;
	        var count_visible = 0,
                count_elements = 0,
                showing_top = 0,
                listing_gun = 0,
                list_active = 0;
	var test = [255];
	for (var i = 1; i < 100; i++) test.push(i + "");

	var menuItems = {

	};

	var menus = {
		"test": {
			header: "Топ меню",
			location: "left-middle",
			items: [{
					text: 'Обычный тип'
				},
				{
					text: 'Выборочный тип',
					values: ['Выбор 1', 'Выбор 2', 'Выбор 3']
				},
				{
					text: 'Выборочный тип',
					values: ['Выбор 1', 'Выбор 2', 'Выбор 3']
				},
				{
					text: 'Выбор цвета',
					type: "choice-color",
					values: ['#0bf', '#fb0', '#bf0']
				},
				{
					text: 'Выбор цвета',
					type: "choice-color",
					values: ['#bf0', '#0bf', '#fb0']
				}
			]
		},
		"character_main": {
			header: "Персонаж",
			location: "left-middle-upper",
			items: [
				{
					text: "Имя",
					placeholder: "Имя",
					type: "text-field"
				},
				{
					text: "Фамилия",
					placeholder: "Фамилия",
					type: "text-field"
				},
				{
					text: "Пол",
					values: ["Мужской", "Женский"]
				},
				{
					text: "Наследственность"
				},
				{
					text: "Характеристики"
				},
				{
					text: "Внешний вид"
				},
				{
					text: "Одежда"
				},
				{
					text: "Далее"
				}
			],
			prompt: "Создайте персонажа.",
			logo: true,
			maxItemsCount: 6,
		},
		"character_parents": {
			header: "Наследственность",
			location: "left-middle-upper",
			items: [{
					text: "Мама",
					values: [ "Ханна", "Одри", "Жасмин", "Жизель", "Амелия",
						"Изабелла", "Зои", "Эва", "Камилла", "Виолетта", "София",
						"Эвелин", "Николь", "Эшли", "Грейс", "Брианна", "Натали",
						"Оливия", "Элизабет", "Шарлотта", "Эмма", "Мисти"
					]
				},
				{
					text: "Папа",
					values: [ "Бенджамин", "Дэниел", "Джошуа", "Ноа", "Эндрю",
						"Хуан", "Алекс", "Исаак", "Эван", "Итан", "Винсент", "Анхель",
						"Диего", "Эдриан", "Габриэль", "Майкл", "Сантьяго", "Кевин",
						"Луис", "Самуил", "Энтони", "Клод", "Джон", "Нико"
					]
				},
				{
					text: "Сходство",
					// values: ["100% с мамой", "75% с мамой", "50%", "75% с папой", "100% с папой"],
					values: [ "0%", "2%", "4%", "6%", "8%", "10%", "12%", "14%", "16%", "18%", "20%", "22%", "24%",
						"26%", "28%", "30%", "32%", "34%", "36%", "38%", "40%", "42%", "44%", "46%", "48%", "50%", "52%",
						"54%", "56%", "58%", "60%", "62%", "64%", "66%", "68%", "70%", "72%", "74%", "76%", "78%", "80%",
						"82%", "84%", "86%", "88%", "90%", "92%", "94%", "96%", "98%", "100%" ]
					,
					valueIndex: 25
				},
				{
					text: "Цвет кожи",
					/* values: ['#c59a7c', '#e7cbaf', '#ffd7a6', '#f2dbcd', '#906a5f'],
					type: "choice-color" */
					values: [ "0%", "2%", "4%", "6%", "8%", "10%", "12%", "14%", "16%", "18%", "20%", "22%", "24%",
						"26%", "28%", "30%", "32%", "34%", "36%", "38%", "40%", "42%", "44%", "46%", "48%", "50%", "52%",
						"54%", "56%", "58%", "60%", "62%", "64%", "66%", "68%", "70%", "72%", "74%", "76%", "78%", "80%",
						"82%", "84%", "86%", "88%", "90%", "92%", "94%", "96%", "98%", "100%" ]
					,
					valueIndex: 25
				},
				/* {
					text: "Характер",
					values: ['Триатлонист', 'Бодибилдер', 'Снайпер', 'Ниндзя', 'Ас', 'Гонщик', 'Нормальный']
				}, */
				{
					text: "Вернуться"
				}
			],
			prompt: "Выберите наследственность.",
			on: () => {
				$(`.selectMenu .family-preview`).show();
			},
			logo: true,
		},
		"character_faceFeatures": {
			header: "Характеристики",
			location: "left-middle-upper",
			prompt: "Измените внешность.",
			logo: true,
			maxItemsCount: 10,
			items: [
				// valueIndex
				{ text: "Ширина носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Положение носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Длина носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Переносица", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Кончик носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Сдвиг переносицы", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Высота лба", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма лба", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Положение скул", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма скул", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Щеки", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Глаза", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Губы", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Ширина челюсти", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма челюсти", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Длина подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Положение подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Ширина подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Шея", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Вернуться" }
			]
		},
		"character_look": {
			header: "Внешний вид",
			location: "left-middle-upper",
			items: [],
			prompt: "Измените внешний вид.",
			logo: true,
			maxItemsCount: 10,
		},
		"character_clothes": {
			header: "Одежда",
			location: "left-middle-upper",
			items: [],
			prompt: "Выберите одежду.",
			logo: true,
		},
		"!enter_house": {
			header: "Дом",
			location: "left-top",
			items: [{
					text: "Войти в дом"
				},
				{
					text: "Позвонить в звонок"
				},
				{
					text: "Информация о доме"
				},
				{
					text: "Закрыть"
				},
			],
			on: () => {
				infoTableAPI.hide();
			},
		},
		"!exit_house": {
			header: "Дверь",
			location: "left-top",
			items: [{
					text: "Выйти на улицу"
				},
				{
					text: "Закрыть"
				},
			],
			on: () => {
				infoTableAPI.hide();
			},
		},
		/*"enter_garage": {
			  header: "Гараж",
			  location: "left-top",
			  items: [
					{text: "Войти в гараж"},
					{text: "Информация о гараже"},
					{text: "Закрыть"},
			  ],
			  on: () => {
					infoTableAPI.hide();
			  },
		},*/
		/*"exit_garage": {
			  header: "Дверь",
			  location: "left-top",
			  items: [
					{text: "Выйти в дом"},
					{text: "Закрыть"},
			  ],
			  on: () => {
					infoTableAPI.hide();
			  },
		},*/
		"biz_18_clothes": {
			header: "Примерочная",
			logo: true,
			location: "right-middle",
			items: [
				{
					text: "Очки"
				},
				{
					text: "Браслеты"
				},
				{
					text: "Серьги"
				},
				{
					text: "Аксессуары"
				},
				{
					text: "Часы"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_20_clothes": {
			header: "Сумки",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_clothes": {
			header: "Примерочная",
			logo: true,
			location: "right-middle",
			items: [{
					text: "Верхняя одежда"
				},
				{
					text: "Нижняя одежда"
				},
				{
					text: "Обувь"
				},
				{
					text: "Головные уборы"
				},
				{
					text: "Майки"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_13_clothes": {
			header: "Маски",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_top": {
			header: "Верхняя одежда",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_legs": {
			header: "Нижняя одежда",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_feets": {
			header: "Обувь",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_hats": {
			header: "Головные уборы",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_undershirts": {
			header: "Майки",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_18_glasses": {
			header: "Очки",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_18_bracelets": {
			header: "Браслеты",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_18_ears": {
			header: "Серьги",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_masks": {
			header: "Маски",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_18_ties": {
			header: "Аксессуары",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_18_watches": {
			header: "Часы",
			logo: true,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_5_items": {
			header: "АЗС",
			npc_name: "Джефри",
			npc_desc: "Заправщик",
			npc_text: "Полный бак для Вашей ласточки, сэр?",
			items: [{
					text: "Заправить",
					values: ["5 л.", "10 л.", "20 л.", "40 л.", "80 л."],
				},
				{
					text: "Пополнить канистру"
				},
				{
					text: "Вернуться"
				},
			],
		},
		"biz_6_items": {
			header: "Магазин",
			location: "right-middle",
			items: [{
					text: "eCola"
				},
				{
					text: "EgoChaser"
				},
				{
					text: "Meteorite"
				},
				{
					text: "P's & Q's"
				},
				{
					text: "Пачка Redwood"
				},
				{
					text: "Pisswasser"
				},
				{
					text: "iUnion"
				},
				{
					text: "Сумка"
				},
				{
					text: "Канистра"
				},
				{
					text: "Бинт"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_7_tatooList": {
			header: "Татуировки",
			location: "left-top",
			items: [{text: ""}]
		},
		"biz_7_tatooList_category": {
			header: "Татуировки",
			location: "left-top",
			items: [{text: ""}]
		},
		"biz_7_deleteTatoo": {
			header: "Удалить татуировку",
			location: "left-top",
			items: [{text: ""}]
		},
		"biz_8_guns": {
			header: "Оружия",
			location: "right-middle",
			items: [{
					text: "Ближний бой"
				},
				{
					text: "Пистолеты"
				},
				{
					text: "Пистолеты-пулеметы"
				},
				{
					text: "Ружья"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_melee": {
			header: "Ближний бой",
			location: "right-middle",
			items: [{
					text: "Бейсбольная бита"
				},
				{
					text: "Кастет"
				},
				{
					text: "Нож"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_handguns": {
			header: "Пистолеты",
			location: "right-middle",
			items: [{
					text: "Pistol"
				},
				{
					text: "AP Pistol"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_submachine_guns": {
			header: "Пистолеты-пулеметы",
			location: "right-middle",
			items: [{
					text: "Micro SMG"
				},
				{
					text: "SMG"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_shotguns": {
			header: "Ружья",
			location: "right-middle",
			items: [{
					text: "Sawed-Off Shotgun"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_ammo": {
			header: "Патроны",
			location: "right-middle",
			items: [{
					text: "Патроны - 9mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 12mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 5.56mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 7.62mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_panel": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
					text: "Информация"
				},
				{
					text: "Касса"
				},
				{
					text: "Доходы и расходы"
				},
				{
					text: "Товар"
				},
				{
					text: "Статус бизнеса"
				},
				{
					text: "Продать бизнес"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"biz_cashbox": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
					text: "Баланс кассы"
				},
				{
					text: "Вывести с кассы"
				},
				{
					text: "Пополнить кассу"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_stats": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
					text: "История кассы"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_products": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
					text: "Закупить товар"
				},
				{
					text: "Списать товар"
				},
				{
					text: "Цена товара"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_staff": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
					text: "Слот №1"
				},
				{
					text: "Слот №2"
				},
				{
					text: "Слот №3"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_rise": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
				text: "Вернуться"
			}, ]
		},
		"biz_status": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
					text: "Открыть бизнес"
				},
				{
					text: "Закрыть бизнес"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_sell": {
			npc_name: "Админ",
			npc_desc: "Админ",
			npc_text: "Это панель управления вашим бизнесом",
			items: [{
					text: "Гражданину"
				},
				{
					text: "Государству"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_storage": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Бронежилет"
				},
				{
					text: "Аксу"
				},
				{
					text: "Револьвер"
				},
				{
					text: "Патроны 7.62"
				},
				{
					text: "Рация"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"mafia_storage": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Нож"
				},
				{
					text: "Heavy Shotgun"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Gusenberg"
				},
				{
					text: "AssaultRifle"
				},
				{
					text: "Рация"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"bus_mash": {
			npc_name: "Даниил",
			npc_desc: "Диспетчер",
			npc_text: "Выберите свой маршрут, маршруты 1 и 2 на атобусной станции №1. Маршруты 3 и 4 на автобусной станции №2",
			 items: [{
				 text: "Маршрут 1 [800$]"
			   },
			   {
				 text: "Маршрут 2 [800$]"
			   },
			   {
				 text: "Маршрут 3 [800$]"
			   },
			   {
				 text: "Маршрут 4 [1800$]"
			   },
			   {
				 text: "Отказаться"
			   },
			]
		},
		"police_storage": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"police_guns": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			location: "right-middle",
			items: [{
					text: "Nightstick"
				},
				{
					text: "Flashlight"
				},
				{
					text: "Stun Gun"
				},
				{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_clothes": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Форма Рекрута"
				},
				{
					text: "Форма Сержанта"
				},
				{
					text: "Форма Офицера"
				},
				{
					text: "Форма SWAT"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_items": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Удостоверение PD"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_ammo": {
			header: "Патроны",
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_service": {
			npc_name: "Мария",
			npc_desc: "Помощник",
			npc_text: "Вы что-то забыли?",
			items: [{
					text: "Мои вещи?",
				},
				{
					text: "Оплата штрафа",
				},
				{
					text: "Закрыть",
				},
			],
			on: (values) => {
				if (!values) return delete menus["police_service_recovery"].items[2].values;
				for (var i = 0; i < values.length; i++)
					values[i] = `№${values[i]}`;
				menus["police_service_recovery"].items[2].values = values;
			}
		},
		"police_service_recovery": {
			npc_name: "Мария",
			npc_desc: "Помощник",
			npc_text: "Вы что-то забыли?",
			items: [{
					text: "Документы",
				},
				{
					text: "Ключи от авто",
				},
				{
					text: "Ключи от дома",
				},
				{
					text: "Вернуться",
				},
			]
		},

		"police_storage_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"police_guns_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Nightstick"
				},
				{
					text: "Flashlight"
				},
				{
					text: "Stun Gun"
				},
				{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_clothes_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Спец. форма №1"
				},
				{
					text: "Форма Кадета"
				},
				{
					text: "Форма Сержанта"
				},
				{
					text: "Форма Лейтенанта"
				},
				{
					text: "Форма Шерифа"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_items_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Удостоверение PD"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_ammo_2": {
			header: "Патроны",
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_service_2": {
			npc_name: "Мария",
			npc_desc: "Помощник",
			npc_text: "Вы что-то забыли?",
			items: [{
					text: "Мои вещи?",
				},
				{
					text: "Оплата штрафа",
				},
				{
					text: "Закрыть",
				},
			],
			on: (values) => {
				if (!values) return delete menus["police_service_recovery_2"].items[2].values;
				for (var i = 0; i < values.length; i++)
					values[i] = `№${values[i]}`;
				menus["police_service_recovery_2"].items[2].values = values;
			}
		},
		"police_service_recovery_2": {
			npc_name: "Мария",
			npc_desc: "Помощник",
			npc_text: "Вы что-то забыли?",
			items: [{
					text: "Документы",
				},
				{
					text: "Ключи от авто",
				},
				{
					text: "Ключи от дома",
				},
				{
					text: "Вернуться",
				},
			]
		},

		"army_storage": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"army_guns": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_clothes": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Комплект №1"
				},
				{
					text: "Комплект №2"
				},
				{
					text: "Комплект №3"
				},
				{
					text: "Комплект №4"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_items": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Удостоверение"
				},
				{
					text: "Рация"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_ammo": {
			header: "Патроны",
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},

		"army_storage_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"army_guns_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_clothes_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Комплект №1"
				},
				{
					text: "Комплект №2"
				},
				{
					text: "Комплект №3"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_items_2": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Удостоверение"
				},
				{
					text: "Рация"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_ammo_2": {
			header: "Патроны",
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"gover_storage": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"gover_guns": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Nightstick"
				},
				{
					text: "Flashlight"
				},
				{
					text: "Stun Gun"
				},
				{
					text: "Combat Pistol"
				},
				{
					text: "Carbine FAMAS"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"gover_clothes": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Стажер USSS"
				},
				{
					text: "Офицер USSS"
				},
				{
					text: "Агент USSS"
				},
				{
					text: "Спецагент USSS"
				},
				{
					text: "Младший адвокат"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"gover_items": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Удостоверение"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Аптечка"
				},
				{
					text: "Нож"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"gover_ammo": {
			header: "Патроны",
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"fib_storage": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"fib_guns": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Nightstick"
				},
				{
					text: "Flashlight"
				},
				{
					text: "Stun Gun"
				},
				{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"fib_clothes": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Стажер"
				},
				{
					text: "Агент"
				},
				{
					text: "Набор №1"
				},
				{
					text: "Набор №2"
				},
				{
					text: "Форма снайпера"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"fib_items": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Удостоверение FIB"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"fib_ammo": {
			header: "Патроны",
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu": {
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Оружия"
				},
				{
					text: "Патроны"
				},
				{
					text: "Наркотики"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"band_dealer_menu_guns": {
			header: "Оружие",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Холодное оружие"
				},
				{
					text: "Пистолеты"
				},
				{
					text: "Пистолеты-пулеметы"
				},
				{
					text: "Ружья"
				},
				{
					text: "Штурмовые винтовки"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_melee": {
			header: "Оружие",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Бейсбольная бита | $200"
				},
				{
					text: "Кастет | $75"
				},
				{
					text: "Нож | $300"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_handguns": {
			header: "Оружие",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Pistol | $800"
				},
				{
					text: "AP Pistol | $1200"
				},
				{
					text: "Heavy Revolver | $1400"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_submachine_guns": {
			header: "Оружие",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Micro SMG | $1800"
				},
				{
					text: "SMG | $1950"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_shotguns": {
			header: "Оружие",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Pump Shotgun | $2400"
				},
				{
					text: "Sawed-Off Shotgun | $2700"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_assault_rifles": {
			header: "Оружие",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Assault Rifle | $2800"
				},
				{
					text: "Bullpup Rifle | $3000"
				},
				{
					text: "Compact Rifle | $3000"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_ammo": {
			header: "Патроны",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Патроны - 9mm | $6",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 12mm | $7",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 5.56mm | $7",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 7.62mm | $6",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_drugs": {
			header: "Наркотики",
			npc_name: "Даниил",
			npc_desc: "Дилер",
			npc_text: "У меня все самое лучшее!",
			items: [{
					text: "Марихуана | $6",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "МДМА | $10",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "Кокаин | $8",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "Метамфетамин | $9",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"hospital_storage": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
			items: [{
					text: "Склад"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"hospital_items": {
			header: "Склад",
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
		    items: [{
		            text: "Аптечка",
		            values: ["1 шт.", "2 шт.", "3 шт."]
		        },
		        {
		            text: "Бинт",
		            values: ["1 шт.", "2 шт.", "3 шт."]
		        },
		        {
		            text: "Удостоверение"
		        },
				{
		            text: "Рация"
		        },
		        {
		            text: "Вернуться"
		        },
		    ]
		},
		"hospital_clothes": {
			npc_name: "Даниил",
			npc_desc: "Охранник",
			npc_text: "Я уже все для тебя приготовил, только возьми то что тебе нужно!",
		    items: [{
		            text: "Форма №1"
		        },
		        {
		            text: "Форма №2"
		        },
		        {
		            text: "Вернуться"
		        },
		    ]
		},
		"rooberauto_menu": {
			npc_name: "Симон",
			npc_desc: "Охранник",
			npc_text: "Автоугон",
			items: [{
					text: "Перегон"
				},
				{
					text: "Автоугон"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"bank_menu": {
			npc_name: "Мария",
			npc_desc: "Кассир",
			npc_text: "Добро пожаловать в наш банк!",
			items: []
		},
		"rent_faggio": {
			npc_name: "Даниил",
			npc_desc: "Арендодатор",
			npc_text: "Аренда авто",
			items: []
		},
		"helper_main": {
			npc_name: "Помощь",
			npc_desc: "Помощь",
			npc_text: "Помощь",
			items: []
		},
		"helper_second": {
			npc_name: "Помощь",
			npc_desc: "Помощь",
			npc_text: "Помощь",
			items: []
		},
		"ls_customs_repair": {
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Ремонт"
				},
				{
					text: "Выход"
				}
			]
		},
		"ls_customs_main": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_concreteMod": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_headlightsMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_headlights": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Стандартные фары"
				},
				{
					text: "Ксеноновые фары"
				}
			]
		},
		"ls_customs_neonMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Расположение неоновых трубок"
				},
				{
					text: "Цвет неона"
				}
			]
		},
		"ls_customs_neonPosition": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Нет"
				},
				{
					text: "Передний"
				},
				{
					text: "Назад"
				},
				{
					text: "По бокам"
				},
				{
					text: "Спереди и сзади"
				},
				{
					text: "Спереди и по бокам"
				},
				{
					text: "Сзади и по бокам"
				},
				{
					text: "Спереди, сзади и по бокам"
				}
			]
		},
		"ls_customs_neonColor": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [/* {
					text: "Белый"
				},
				{
					text: "Синий"
				},
				{
					text: '"Электрический голубой"'
				},
				{
					text: '"Мятно-зеленый"'
				},
				{
					text: "Лайм"
				},
				{
					text: "Желтый"
				},
				{
					text: '"Золотой дождь"'
				},
				{
					text: "Оранжевый"
				},
				{
					text: "Красный"
				},
				{
					text: '"Розовый пони"'
				},
				{
					text: "Ярко-розовый"
				},
				{
					text: "Фиолетовый"
				},
				{
					text: '"Черный свет"'
				} */
			]
		},
		"ls_customs_hornsMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Стаднарт"
				},
				{
					text: "Музыкальные"
				},
				{
					text: "С повтором"
				}
			]
		},
		"ls_customs_hornsConcrete": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_numberPlate": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Синий на белом 1"
				},
				{
					text: "Синий на белом 2"
				},
				{
					text: "Синий на белом 3"
				},
				{
					text: "Желтый на синем"
				},
				{
					text: "Желтый на черном"
				}
			]
		},
		"ls_customs_colorMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Основной цвет"
				},
				{
					text: "Дополнительный цвет"
				}
			]
		},
		"ls_customs_colorGroup": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [{
					text: "Хромированный"
				},
				{
					text: "Классический"
				},
				{
					text: "Матовый"
				},
				{
					text: "Металлик"
				},
				{
					text: "Металл"
				}
			]
		},
		"ls_customs_colorConcrete": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_wheelsMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
						{ text: "Колёса" },
						{ text: "Цвет колёс" },
						{ text: "Шины" },
					]
			},
		"ls_customs_wheels_motoMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
							{ text: "Переднее колесо" },
							{ text: "Заднее колесо" }
						]
				},
		"ls_customs_wheels_carMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
							{ text: "Эксклюзивные" },
							{ text: "Лоурайдер" },
							{ text: "Маслкар" },
							{ text: "Вездеход" },
							{ text: "Спорт" },
							{ text: "Внедорожник" },
							{ text: "Тюнер" }
						]
		},
		"ls_customs_wheels_typeMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
							{ text: "Стандартные диски" },
							{ text: "Хромированные диски" }
						]
		},
		"ls_customs_wheels_colors": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_wheels_concreteMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_wheels_tiresMenu": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
				{ text: "Дизайн шин" },
				{ text: "Улучшение шин" },
				{ text: "Дым от покрышек" }
			]
		},
		"ls_customs_wheels_tiresDesign": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
				/* { text: "Обычные покрышки" },
				{ text: "Заказные покрышки" } */
			]
		},
		"ls_customs_wheels_tiresUpgrade": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
				/* { text: "Пулестойкие покрышки" } */
			]
		},
		"ls_customs_wheels_tiresSmokeColor": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: []
		},
		"ls_customs_turbo": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
				/* { text: "Нет" },
				{ text: "Турбо-тюнинг" } */
			]
		},
		"ls_customs_windows": {
			header: "LS Custom",
			npc_name: "Гектор",
			npc_desc: "Механик",
			npc_text: "Здравствуйте. Добро пожаловать в Los Santos Customs!",
			items: [
				/* { text: "Нет" },
				{ text: "Слабое затемнение" },
				{ text: "Среднее затемнение" },
				{ text: "Лимузин" } */
			]
		},
		"enter_driving_school": {
			npc_name: "Мелихан",
			npc_desc: "Лицензер",
			npc_text: "Здравствуйте. Добро пожаловать в Центр лицензирования",
			items: [{
					text: "Лицензии"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"driving_school_licenses": {
			npc_name: "Мелихан",
			npc_desc: "Лицензер",
			npc_text: "Здравствуйте. Добро пожаловать в Центр лицензирования",
			items: [{
					text: "Водитель"
				},
				{
					text: "Водный транспорт"
				},
				{
					text: "Пилот"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"driving_school_car": {
			npc_name: "Мелихан",
			npc_desc: "Лицензер",
			npc_text: "Здравствуйте. Добро пожаловать в Центр лицензирования",
			items: [{
					text: "Автомобиль"
				},
				{
					text: "Мототехника"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"driving_school_water": {
			npc_name: "Мелихан",
			npc_desc: "Лицензер",
			npc_text: "Здравствуйте. Добро пожаловать в Центр лицензирования",
			items: [{
					text: "Лодки"
				},
				{
					text: "Яхты"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"driving_school_fly": {
			npc_name: "Мелихан",
			npc_desc: "Лицензер",
			npc_text: "Здравствуйте. Добро пожаловать в Центр лицензирования",
			items: [{
					text: "Вертолёты"
				},
				{
					text: "Самолёты"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"trucker_load": {
			npc_name: "Мелихан",
			npc_desc: "Дальнобойщик",
			npc_text: "Загрузка прицепа",
			items: [{
					text: "Взять заказ",
				},
				{
					text: "Закрыть"
				},
			],
		},
		"trucker_load_two": {
			header: "Загрузка прицепа",
			npc_name: "Мелихан",
			npc_desc: "Дальнобойщик",
			npc_text: "Загрузка прицепа",
			items: [{
					text: "Загрузить",
					values: ["1 т.", "5 т.", "10 т.", "15 т.", "20 т.", "25 т.", "30 т.", "35 т.", "40 т.", "45 т.", "50 т.", "55 т.", "60 т."]
				},
				{
					text: "Вернуться"
				},
			],
			/*on: () => {
				menus["trucker_load_two"].items[0].values = [];
				for (var i = 0; i < 50; i++) menus["trucker_load"].items[0].values.push(`${i + 1} т.`);
			},*/
		},
		"barbershop_m_main": {
			header: "Барбершоп",
			items: [
				{ text: "Причёски" },
				{ text: "Бороды" },
				{ text: "Брови" },
				{ text: "Грудь" },
				{ text: "Линзы" },
				{ text: "Раскраска лица" },
				{ text: "Макияж" },
				{ text: "Уйти" }
			]
		},
		"barbershop_f_main": {
			header: "Барбершоп",
			items: [
				{ text: "Причёски" },
				{ text: "Брови" },
				{ text: "Линзы" },
				{ text: "Раскраска лица" },
				{ text: "Макияж" },
				{ text: "Уйти" }
			]
		},
		"barbershop_concrete": {
			header: "Барбершоп",
			items: []
		},
		"barbershop_makeupMenu_m": {
			header: "Барбершоп",
			items: [
				{ text: "Глаз" },
				{ text: "Помада" }
			]
		},
		"barbershop_makeupMenu_f": {
			header: "Барбершоп",
			items: [
				{ text: "Румяна" },
				{ text: "Глаз" },
				{ text: "Помада" }
			]
		},

		"enter_farm": {
			npc_name: "Ферма",
			npc_desc: "Ферма",
			npc_text: "Ферма",
			items: [
				{
					text: "Работа"
				},
				{
					text: "Информация"
				},
				{
					text: "Помощь"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"enter_farm_job": {
			npc_name: "Ферма",
			npc_desc: "Ферма",
			npc_text: "Ферма",
			items: [
				{
					text: "Рабочий"
				},
				{
					text: "Фермер"
				},
				{
					text: "Тракторист"
				},
				{
					text: "Пилот"
				},
				{
					text: "Уволиться"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"farm_warehouse": {
			npc_name: "Ферма",
			npc_desc: "Ферма",
			npc_text: "Ферма",
			items: [
				{
					text: "Посев зерна",
				},
				{
					text: "Покупка урожая",
				},
				{
					text: "Продажа зерна",
				},
				{
					text: "Выгрузка урожая",
				},
				{
					text: "Закрыть"
				},
			]
		},
		"farm_warehouse_fill_field": {
			npc_name: "Ферма",
			npc_desc: "Ферма",
			npc_text: "Ферма",
			items: [
				{
					text: "Поле",
					values: ["Участок №1", "Участок №2", "Участок №3", "Участок №4"],
				},
				{
					text: "Зерно",
					values: ["Тыква", "Капуста", "Травка"],
				},
				{
					text: "Загрузить",
				},
				{
					text: "Вернуться"
				},
			]
		},
		"farm_warehouse_buy_crop": {
			npc_name: "Ферма",
			npc_desc: "Ферма",
			npc_text: "Ферма",
			items: [
				{
					text: "Урожай",
					values: ["Тыква", "Капуста", "Травка"],
				},
				{
					text: "Количество",
					values: ["1 ед.", "2 ед.", "3 ед."],
				},
				{
					text: "Закупить",
				},
				{
					text: "Вернуться"
				},
			]
		},
		"farm_warehouse_sell_grain": {
			npc_name: "Ферма",
			npc_desc: "Ферма",
			npc_text: "Ферма",
			items: [
				{
					text: "Количество",
					values: ["1 ед.", "2 ед.", "3 ед."],
				},
				{
					text: "Продать",
				},
				{
					text: "Вернуться"
				},
			]
		},
	};
	var itemSelectedHandlers = {
		"farm_warehouse_fill_field": (itemName, itemValue, itemIndex) => {
			var fieldIdValueIndex = menus["farm_warehouse_fill_field"].items[0].valueIndex;
			if (!fieldIdValueIndex) fieldIdValueIndex = 0;
			var fieldId = parseInt(menus["farm_warehouse_fill_field"].items[0].values[fieldIdValueIndex].split(" ")[1].substr(1));

			var grainTypeValueIndex = menus["farm_warehouse_fill_field"].items[1].valueIndex;
			if (!grainTypeValueIndex) grainTypeValueIndex = 0;

			mp.trigger(`events.callRemote`, `farm.warehouse.takeGrain`, JSON.stringify([fieldId, grainTypeValueIndex + 1]));
			selectMenuAPI.hide();
		},
	};

	window.selectMenuAPI = {
		show: (menuName, selectedIndex = 0, values = null) => {
			// alert(`selectMenu.show ${menuName} ${selectedIndex} ${values}`);
			                        //$(window).unbind("keydown", menuTransition)
			count_visible = 0;
			count_elements = 0;
			showing_top = 0;
			listing_gun = 0;
			list_active = 0;
			if (!selectedIndex) selectedIndex = 0;
			var menu = menus[menuName];
			if (!menu) return;

			menu.name = menuName;
			window.currentMenu = menu;
			if (values != null && values != 'null') menu.on(JSON.parse(values));
			else if (menu.on) menu.on();

			var maxItemsCount = MAX_ITEMS_COUNT;
			if (menu.maxItemsCount) maxItemsCount = menu.maxItemsCount;

			var itemsCount = Math.min(menu.items.length, maxItemsCount);
			var height = itemsCount * ITEM_HEIGHT + "vh";
			$(".selectMenu .body").height(height);
			$(".selectMenu .header").text(menu.header);
			$('.selectMenu .name').text(menu.npc_name);
			$('.selectMenu .desc').text(menu.npc_desc);
			$('.selectMenu .text').text(menu.npc_text);
			$(".selectMenu .count").text(`1/${menu.items.length}`);
			$(".selectMenu .content").empty();

			var start = (selectedIndex < maxItemsCount) ? 0 : (selectedIndex - maxItemsCount + 1);
			for (var i = start; i < start + itemsCount; i++) {
				selectMenuAPI.addLastMenuItemToDOM(i);
			}

			if (menu.items[selectedIndex].values) {
				var value = $('.selectMenu .items td').eq(1).html();
				$('.selectMenu .items td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
			}
			$(`.selectMenu .items tr[data-index="${selectedIndex}"]`).addClass("selected");
			if (menu.items[selectedIndex].type == "text-field") {
				setTimeout(() => {
					$('.selectMenu .selected input').focus();
				}, 5);
			}

			if (menu.location == "right-middle" && !chatAPI.isLeft())
				menu.location = "left-middle";
			else if (menu.location == "left-middle" && chatAPI.isLeft())
				menu.location = "right-middle";

			$(`.selectMenu .promptHelp`).hide()
			if (menu.prompt) {
				$(`.selectMenu .promptHelp .text`).text(menu.prompt);
				$(`.selectMenu .promptHelp`).slideDown("fast");
			}

			$(`.selectMenu .hand-navigation`).hide();
			if (menu.items.length > maxItemsCount) {
				$(`.selectMenu .hand-navigation`).slideDown("fast");
			}

					if (menuName != "character_parents") $(`.selectMenu .family-preview`).hide();
                        
                        $('.selectMenu .block_list').each(function (i, elem) {
                            count_elements++;
                            if (count_elements == 1)
                                $(elem).addClass('active');
                            if (count_visible < 8) {
                                $(elem).removeClass('hide');
                                count_visible++;
                            } else {
                                $(elem).addClass('hide');
                            }
                        });

                        if (count_elements < 9)
                            $('.selectMenu .footer').hide();
                        else
                            $('.selectMenu .footer').show();
                        $('.selectMenu .content .list_in_block img').click(function (e) {
                            let type = $(this).attr('data-action');
                            if (type == "back") {
                                listing_gun--;
                                if (listing_gun >= 0) {
                                    $('.selectMenu .content .list_in_block .text').each(function (i, elem) {
                                        if ($(elem).attr('data-edit') == $(this).attr('data-edit')) {
                                            $(elem).html(names_gun[listing_gun]);
                                        }
                                    });
                                } else
                                    listing_gun = 0;
                            } else {
                                listing_gun++;
                                if (listing_gun <= names_gun.length - 1)
                                {
                                    $('.selectMenu .content .list_in_block .text').each(function (i, elem) {
                                        if ($(elem).attr('data-edit') == $(this).attr('data-edit')) {
                                            $(elem).html(names_gun[listing_gun]);
                                        }
                                    });
                                } else
                                    listing_gun = names_gun.length - 1;
                            }
                        });

			//$(window).bind("keydown", menuTransition)
                        $('.selectMenu .block_list').click((e) => {
				var itemIndex = e.currentTarget.dataset.index
				var items = currentMenu.items;
				var itemValue = null;
				if (items[itemIndex].valueIndex == null && items[itemIndex].values) items[itemIndex].valueIndex = 0;
				var valueIndex = (items[itemIndex].valueIndex == null) ? -1 : items[itemIndex].valueIndex;
				if (valueIndex != -1 && items[itemIndex].values) itemValue = items[itemIndex].values[valueIndex];
				if (itemSelectedHandlers[currentMenu.name]) return itemSelectedHandlers[currentMenu.name](items[itemIndex - 1].text, items[itemIndex].text, itemValue, itemIndex);
				console.log("currentMenu.name", currentMenu.name)
				console.log("items[itemIndex]", items[itemIndex])
				console.log("itemIndex", itemIndex)
				console.log("itemValue", itemValue)
				mp.trigger(`selectMenu.itemSelected`, currentMenu.name, JSON.stringify(items[itemIndex]), itemValue, itemIndex);
				console.log($('.selectMenu').find('.block_list.active').text())
			})
			$(".selectMenu").slideDown(1);
			mp.trigger(`setSelectMenuActive`, true);
			setCursor(true);
		},
		hide: () => {
			window.currentMenu = null;
			$(".selectMenu").slideUp(1);
                        //$(window).unbind("keydown", menuTransition);
			count_visible = 0;
			count_elements = 0;
			showing_top = 0;
			listing_gun = 0;
			list_active = 0;
			mp.trigger(`setSelectMenuActive`, false);
			setCursor(false);
		},
		addLastMenuItemToDOM: (i) => {
			if (!currentMenu) return;
			var menu = currentMenu;
			var menuName = currentMenu.name;
			var value = "";
			var defaultIndex = menu.items[i].valueIndex || 0;

                        if (menu.items[i].type == "choice-color") {
                            value = menu.items[i].values[defaultIndex];
                            var el = $(`<div class="block_list " data-index='${i}'><div class="text">${menu.items[i].text}</div></div>`);
                            el.children('.color-td').children('div').css('background', value);
                            $(".selectMenu .content").append(el);
                        } else if (menu.items[i].type == "text-field") {
                            value = menu.items[i].value || "";
                            var placeholder = menu.items[i].placeholder || "";
                            $(".selectMenu .content").append(`<div class="block_list " data-index='${i}'><div class="text">${menu.items[i].text}</div></div>`);
                        } else {
                            if (menu.items[i].values)
                                value = menu.items[i].values[defaultIndex];
                            $(".selectMenu .content").append(`<div class="block_list " data-index='${i}'><div class="text">${menu.items[i].text} ${value}</div></div>`);
                        }
		},
		addFirstMenuItemToDOM: (i) => {
			if (!currentMenu) return;
			var menu = currentMenu;
			var menuName = currentMenu.name;
			var value = "";
			var defaultIndex = menu.items[i].valueIndex || 0;

                        if (menu.items[i].type == "choice-color") {
                            value = menu.items[i].values[defaultIndex];
                            var el = $(`<div class="block_list " data-index='${i}'><div class="text">${menu.items[i].text}</div></div>`);
                            $(".selectMenu .items").prepend(el);
                        } else if (menu.items[i].type == "text-field") {
                            value = menu.items[i].value;
                            var placeholder = menu.items[i].placeholder || "";
                            $(".selectMenu .content").prepend(`<div class="block_list " data-index='${i}'><div class="text">${menu.items[i].text}</div></div>`);
                        } else {
                            if (menu.items[i].values)
                                value = menu.items[i].values[defaultIndex];
                            $(".selectMenu .content").prepend(`<div class="block_list " data-index='${i}'><div class="text">${menu.items[i].text}</div></div>`);
                        }
		},
		active: () => {
			return $(".selectMenu").css("display") != "none";
		},
		init: () => {
			$(document).unbind('keydown', selectMenuAPI.handler);
			$(document).keydown(selectMenuAPI.handler);
		},
		clearState: (menuName) => {
			var items = menus[menuName].items;
			if (!items) return;
			for (var i = 0; i < items.length; i++) {
				items[i].valueIndex = 0;
			}
		},
		setItems: (menuName, itemsName) => {
			var menu = menus[menuName];
			var items = menuItems[itemsName];
			if (!menu || !items) return;

			menu.items = items;
		},
		setSpecialItems: (menuName, items) => {
			//debug(`selectMenuAPI.setSpecialItems: ${menuName} ${items}`)
			if (typeof items == "string") items = JSON.parse(items);
			var menu = menus[menuName];
			if (!menu || !items) return;
			menu.items = items;
		},
		setItemName: (menuName, index, newName) => {
			var menu = menus[menuName];
			if (!menu.items[index]) return;
			menu.items[index] = newName;
		},
		setHeader: (menuName, npc_text) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			menu.npc_text = npc_text;
		},
		setPrompt: (menuName, text) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			menu.prompt = text;
		},
		setItemValueIndex: (menuName, itemIndex, index) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			if (!menu.items[itemIndex]) {
				return;
			}

			menu.items[itemIndex].valueIndex = index;
		},
		handler: (e) => {
			if (window.bindlocker(true)) return
			if (!currentMenu) return;
			if (e.keyCode == 38) { //up

				var items = currentMenu.items;
				var itemIndex = $(".selectMenu .selected").data("index");
				if (itemIndex < 1) return;

				if ($(".selectMenu .selected").is(":first-child")) {
					$(".selectMenu .items tr:last").remove();
					selectMenuAPI.addFirstMenuItemToDOM(itemIndex - 1);
				}

				if (items[itemIndex].type == "text-field") {
					items[itemIndex].value = $(".selectMenu .selected input").val();
					$(".selectMenu .selected input").blur();
				}

				$(".selectMenu .count").text(`${itemIndex}/${items.length}`);
				if (items[itemIndex].values) $('.selectMenu .selected b').remove();

				$(".selectMenu .items .selected").removeClass("selected");
				$(`tr[data-index="${itemIndex-1}"]`).attr("class", "selected");

				var itemValue = null;
				if (items[itemIndex - 1].values) {
					var value = $('.selectMenu .selected td').eq(1).html();
					var valueIndex = items[itemIndex - 1].valueIndex || 0;
					itemValue = items[itemIndex - 1].values[valueIndex];
					$('.selectMenu .selected td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
				}
				if (items[itemIndex - 1].type == "text-field") {
					setTimeout(() => {
						$(".selectMenu .selected input").focus();
					}, 5);
				}

				mp.trigger(`selectMenu.itemFocusChanged`, currentMenu.name, JSON.stringify(items[itemIndex - 1]), itemValue, itemIndex - 1, valueIndex);
			} else if (e.keyCode == 40) { //bottom
				var items = currentMenu.items;
				var itemIndex = $(".selectMenu .selected").data("index");
				if (itemIndex >= items.length - 1) return;

				if ($(".selectMenu .selected").is(":last-child")) {
					$(".selectMenu .items tr:first").remove();
					selectMenuAPI.addLastMenuItemToDOM(itemIndex + 1);
				}

				if (items[itemIndex].type == "text-field") {
					items[itemIndex].value = $(".selectMenu .selected input").val();
					$(".selectMenu .selected input").blur();
				}

				$(".selectMenu .count").text(`${itemIndex+2}/${items.length}`);
				if (items[itemIndex].values) $('.selectMenu .selected b').remove();


				$(".selectMenu .items .selected").removeClass("selected");
				$(`tr[data-index="${itemIndex+1}"]`).attr("class", "selected");

				var itemValue = null;
				if (items[itemIndex + 1].values) {
					var value = $('.selectMenu .selected td').eq(1).html();
					var valueIndex = items[itemIndex + 1].valueIndex || 0;
					itemValue = items[itemIndex + 1].values[valueIndex];
					$('.selectMenu .selected td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
				}
				if (items[itemIndex + 1].type == "text-field") {
					setTimeout(() => {
						$(".selectMenu .selected input").focus();
					}, 5);
				}

				mp.trigger(`selectMenu.itemFocusChanged`, currentMenu.name, JSON.stringify(items[itemIndex + 1]), itemValue, itemIndex + 1, valueIndex);
			} else if (e.keyCode == 37) { //left
				var items = currentMenu.items;
				var itemIndex = $(".selectMenu .selected").data("index");
				if (!items[itemIndex].values) return;

				var valueIndex = items[itemIndex].valueIndex || 0;
				if (valueIndex < 1) return;

				value = items[itemIndex].values[valueIndex - 1];
				items[itemIndex].valueIndex = valueIndex - 1;
				if (items[itemIndex].type != "choice-color")
					$(".selectMenu .selected td").eq(1).html(`<b>< </b>${value}<b> ></b>`);
				else {
					$(".selectMenu .selected .color-td").html(`<b>< </b><div></div><b> ></b>`);
					$(".selectMenu .selected div").css("background", value);
				}

				mp.trigger(`selectMenu.itemValueChanged`, currentMenu.name, items[itemIndex].text, value, itemIndex, valueIndex - 1);
			} else if (e.keyCode == 39) { //right
				var items = currentMenu.items;
				var itemIndex = $(".selectMenu .selected").data("index");
				if (!items[itemIndex].values) return;

				var valueIndex = items[itemIndex].valueIndex || 0;
				if (valueIndex >= items[itemIndex].values.length - 1)
					return;

				value = items[itemIndex].values[valueIndex + 1];
				items[itemIndex].valueIndex = valueIndex + 1;
				if (items[itemIndex].type != "choice-color")
					$(".selectMenu .selected td").eq(1).html(`<b>< </b>${value}<b> ></b>`);
				else {
					$(".selectMenu .selected .color-td").html(`<b>< </b><div></div><b> ></b>`);
					$(".selectMenu .selected div").css("background", value);
				}

				mp.trigger(`selectMenu.itemValueChanged`, currentMenu.name, items[itemIndex].text, value, itemIndex, valueIndex + 1);
			} else if (e.keyCode == 13) { //enter
				var items = currentMenu.items;
				var itemIndex = $(".selectMenu .selected").data("index");
				var itemValue = null;
				if (items[itemIndex].valueIndex == null && items[itemIndex].values) items[itemIndex].valueIndex = 0;
				var valueIndex = (items[itemIndex].valueIndex == null) ? -1 : items[itemIndex].valueIndex;
				if (valueIndex != -1 && items[itemIndex].values) itemValue = items[itemIndex].values[valueIndex];
				if (itemSelectedHandlers[currentMenu.name]) return itemSelectedHandlers[currentMenu.name](items[itemIndex - 1].text, items[itemIndex].text, itemValue, itemIndex);
				mp.trigger(`selectMenu.itemSelected`, currentMenu.name, JSON.stringify(items[itemIndex]), itemValue, itemIndex);
			} /*else if (e.keyCode == 8) { //backspace
				var items = currentMenu.items;
				var itemIndex = $(".selectMenu .selected").data("index");
				var itemValue = null;
				var valueIndex = items[itemIndex].valueIndex || -1;
				if (valueIndex != -1) itemValue = items[itemIndex].values[valueIndex];

				mp.trigger(`selectMenu.backspacePressed`, currentMenu.name, items[itemIndex].text, itemValue, itemIndex);
			}*/
		},
		getValue: (menuName, itemName) => {
			if (!menus[menuName]) return name;
			var items = menus[menuName].items;
			for (var i = 0; i < items.length; i++)
				if (items[i].text == itemName) return items[i].value;

			return null;
		},
	};

	//selectMenuAPI.init();
	
	window.selectMenuAPITalRasha = {
		show: (menuName, selectedIndex = 0, values = null) => {
			// alert(`selectMenu.show ${menuName} ${selectedIndex} ${values}`);
			if (!selectedIndex) selectedIndex = 0;
			var menu = menus[menuName];
			if (!menu) return;

			menu.name = menuName;
			window.currentMenu = menu;
			if (values != null && values != 'null') menu.on(JSON.parse(values));
			else if (menu.on) menu.on();

			var maxItemsCount = MAX_ITEMS_COUNTTALRASHA;
			if (menu.maxItemsCount) maxItemsCount = menu.maxItemsCount;

			var itemsCount = Math.min(menu.items.length, maxItemsCount);
			var height = itemsCount * ITEM_HEIGHTTALRASHA + "vh";
			$(".selectMenuTalRasha .body").height(height);
			$(".selectMenuTalRasha .name").text(menu.header);
			$(".selectMenuTalRasha .count").text(`1/${menu.items.length}`);
			$(".selectMenuTalRasha .items").empty();

			var start = (selectedIndex < maxItemsCount) ? 0 : (selectedIndex - maxItemsCount + 1);
			for (var i = start; i < start + itemsCount; i++) {
				selectMenuAPITalRasha.addLastMenuItemToDOM(i);
			}

			if (menu.items[selectedIndex].values) {
				var value = $('.selectMenuTalRasha .items td').eq(1).html();
				$('.selectMenuTalRasha .items td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
			}
			$(`.selectMenuTalRasha .items tr[data-index="${selectedIndex}"]`).addClass("selected");
			if (menu.items[selectedIndex].type == "text-field") {
				setTimeout(() => {
					$('.selectMenuTalRasha .selected input').focus();
				}, 5);
			}

			if (menu.location == "right-middle" && !chatAPI.isLeft())
				menu.location = "left-middle";
			else if (menu.location == "left-middle" && chatAPI.isLeft())
				menu.location = "right-middle";

			$(`.selectMenuTalRasha .promptHelp`).hide()
			if (menu.prompt) {
				$(`.selectMenuTalRasha .promptHelp .text`).text(menu.prompt);
				$(`.selectMenuTalRasha .promptHelp`).slideDown(1);
			}

			$(`.selectMenuTalRasha .hand-navigation`).hide();
			if (menu.items.length > maxItemsCount) {
				$(`.selectMenuTalRasha .hand-navigation`).slideDown(1);
			}

			$(`.selectMenuTalRasha .union-img`).hide();
			if (menu.logo) $(`.selectMenuTalRasha .union-img`).show();

			if (menuName != "character_parents") $(`.selectMenuTalRasha .family-preview`).hide();
			
				//$(window).bind("keydown", menuTransition)
                $('.selectMenuTalRasha tr').click((e) => {
				var itemIndex = e.currentTarget.dataset.index
				var items = currentMenu.items;
				var itemValue = null;
				if (items[itemIndex].valueIndex == null && items[itemIndex].values) items[itemIndex].valueIndex = 0;
				var valueIndex = (items[itemIndex].valueIndex == null) ? -1 : items[itemIndex].valueIndex;
				if (valueIndex != -1 && items[itemIndex].values) itemValue = items[itemIndex].values[valueIndex];
				if (itemSelectedHandlers[currentMenu.name]) return itemSelectedHandlers[currentMenu.name](items[itemIndex - 1].text, items[itemIndex].text, itemValue, itemIndex);
				mp.trigger(`selectMenu.itemSelectedclothes`, currentMenu.name, JSON.stringify(items[itemIndex]), itemValue, itemIndex);
			})
			
			$(".selectMenuTalRasha").slideDown(1);
			mp.trigger(`setSelectMenuActive`, true);
			setCursor(true);
		},
		hide: () => {
			window.currentMenu = null;
			$(".selectMenuTalRasha").slideUp(1);
			mp.trigger(`setSelectMenuActive`, false);
		},
		addLastMenuItemToDOM: (i) => {
			if (!currentMenu) return;
			var menu = currentMenu;
			var menuName = currentMenu.name;
			var value = "";
			var defaultIndex = menu.items[i].valueIndex || 0;

			if (menu.items[i].type == "choice-color") {

				value = menu.items[i].values[defaultIndex];
				var el = $(`<tr data-index='${i}'>
							  <td>${menu.items[i].text}</td>
							  <td align="right" class="color-td"><div></div></td>
						</tr>`);
				el.children('.color-td').children('div').css('background', value);

				$(".selectMenuTalRasha .items").append(el);
			} else if (menu.items[i].type == "text-field") {
				value = menu.items[i].value || "";
				var placeholder = menu.items[i].placeholder || "";
				$(".selectMenuTalRasha .items").append(`<tr data-index='${i}'>
							  <td>${menu.items[i].text}</td>
							  <td align="right"><input type='text' placeholder='${placeholder}' value='${value}' /></td>
						</tr>`);
			} else {
				if (menu.items[i].values) value = menu.items[i].values[defaultIndex];

				$(".selectMenuTalRasha .items").append(`<tr data-index='${i}'>
							  <td>${menu.items[i].text}</td>
							  <td align="right">${value}</td>
						</tr>`);
			}
		},
		addFirstMenuItemToDOM: (i) => {
			if (!currentMenu) return;
			var menu = currentMenu;
			var menuName = currentMenu.name;
			var value = "";
			var defaultIndex = menu.items[i].valueIndex || 0;

			if (menu.items[i].type == "choice-color") {


				value = menu.items[i].values[defaultIndex];
				var el = $(`<tr data-index='${i}'>
							  <td>${menu.items[i].text}</td>
							  <td align="right" class="color-td"><div></div></td>
						</tr>`);
				el.children('.color-td').children('div').css('background', value);

				$(".selectMenuTalRasha .items").prepend(el);
			} else if (menu.items[i].type == "text-field") {
				value = menu.items[i].value;
				var placeholder = menu.items[i].placeholder || "";
				$(".selectMenuTalRasha .items").prepend(`<tr data-index='${i}'>
							  <td>${menu.items[i].text}</td>
							  <td align="right"><input type='text' placeholder='${placeholder}' value='${value}' /></td>
						</tr>`);
			} else {
				if (menu.items[i].values) value = menu.items[i].values[defaultIndex];

				$(".selectMenuTalRasha .items").prepend(`<tr data-index='${i}'>
							  <td>${menu.items[i].text}</td>
							  <td align="right">${value}</td>
						</tr>`);
			}
		},
		active: () => {
			return $(".selectMenuTalRasha").css("display") != "none";
		},
		init: () => {
			$(document).unbind('keydown', selectMenuAPITalRasha.handler);
			$(document).keydown(selectMenuAPITalRasha.handler);
		},
		clearState: (menuName) => {
			var items = menus[menuName].items;
			if (!items) return;
			for (var i = 0; i < items.length; i++) {
				items[i].valueIndex = 0;
			}
		},
		setItems: (menuName, itemsName) => {
			var menu = menus[menuName];
			var items = menuItems[itemsName];
			if (!menu || !items) return;

			menu.items = items;
		},
		setSpecialItems: (menuName, items) => {
			//debug(`selectMenuAPITalRasha.setSpecialItems: ${menuName} ${items}`)
			if (typeof items == "string") items = JSON.parse(items);
			var menu = menus[menuName];
			if (!menu || !items) return;
			menu.items = items;
		},
		setItemName: (menuName, index, newName) => {
			var menu = menus[menuName];
			if (!menu.items[index]) return;
			menu.items[index] = newName;
		},
		setHeader: (menuName, header) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			menu.header = header;
		},
		setPrompt: (menuName, text) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			menu.prompt = text;
		},
		setItemValueIndex: (menuName, itemIndex, index) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			if (!menu.items[itemIndex]) {
				return;
			}

			menu.items[itemIndex].valueIndex = index;
		},
		handler: (e) => {
			if (window.bindlocker(true)) return
			if (!currentMenu) return;
			if (e.keyCode == 38) { //up

				var items = currentMenu.items;
				var itemIndex = $(".selectMenuTalRasha .selected").data("index");
				if (itemIndex < 1) return;

				if ($(".selectMenuTalRasha .selected").is(":first-child")) {
					$(".selectMenuTalRasha .items tr:last").remove();
					selectMenuAPITalRasha.addFirstMenuItemToDOM(itemIndex - 1);
				}

				if (items[itemIndex].type == "text-field") {
					items[itemIndex].value = $(".selectMenuTalRasha .selected input").val();
					$(".selectMenuTalRasha .selected input").blur();
				}

				$(".selectMenuTalRasha .count").text(`${itemIndex}/${items.length}`);
				if (items[itemIndex].values) $('.selectMenuTalRasha .selected b').remove();

				$(".selectMenuTalRasha .items .selected").removeClass("selected");
				$(`tr[data-index="${itemIndex-1}"]`).attr("class", "selected");

				var itemValue = null;
				if (items[itemIndex - 1].values) {
					var value = $('.selectMenuTalRasha .selected td').eq(1).html();
					var valueIndex = items[itemIndex - 1].valueIndex || 0;
					itemValue = items[itemIndex - 1].values[valueIndex];
					$('.selectMenuTalRasha .selected td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
				}
				if (items[itemIndex - 1].type == "text-field") {
					setTimeout(() => {
						$(".selectMenuTalRasha .selected input").focus();
					}, 5);
				}

				mp.trigger(`selectMenu.itemFocusChanged`, currentMenu.name, JSON.stringify(items[itemIndex - 1]), itemValue, itemIndex - 1, valueIndex);
			} else if (e.keyCode == 40) { //bottom
				var items = currentMenu.items;
				var itemIndex = $(".selectMenuTalRasha .selected").data("index");
				if (itemIndex >= items.length - 1) return;

				if ($(".selectMenuTalRasha .selected").is(":last-child")) {
					$(".selectMenuTalRasha .items tr:first").remove();
					selectMenuAPITalRasha.addLastMenuItemToDOM(itemIndex + 1);
				}

				if (items[itemIndex].type == "text-field") {
					items[itemIndex].value = $(".selectMenuTalRasha .selected input").val();
					$(".selectMenuTalRasha .selected input").blur();
				}

				$(".selectMenuTalRasha .count").text(`${itemIndex+2}/${items.length}`);
				if (items[itemIndex].values) $('.selectMenuTalRasha .selected b').remove();


				$(".selectMenuTalRasha .items .selected").removeClass("selected");
				$(`tr[data-index="${itemIndex+1}"]`).attr("class", "selected");

				var itemValue = null;
				if (items[itemIndex + 1].values) {
					var value = $('.selectMenuTalRasha .selected td').eq(1).html();
					var valueIndex = items[itemIndex + 1].valueIndex || 0;
					itemValue = items[itemIndex + 1].values[valueIndex];
					$('.selectMenuTalRasha .selected td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
				}
				if (items[itemIndex + 1].type == "text-field") {
					setTimeout(() => {
						$(".selectMenuTalRasha .selected input").focus();
					}, 5);
				}

				mp.trigger(`selectMenu.itemFocusChanged`, currentMenu.name, JSON.stringify(items[itemIndex + 1]), itemValue, itemIndex + 1, valueIndex);
			} else if (e.keyCode == 37) { //left
				var items = currentMenu.items;
				var itemIndex = $(".selectMenuTalRasha .selected").data("index");
				if (!items[itemIndex].values) return;

				var valueIndex = items[itemIndex].valueIndex || 0;
				if (valueIndex < 1) return;

				value = items[itemIndex].values[valueIndex - 1];
				items[itemIndex].valueIndex = valueIndex - 1;
				if (items[itemIndex].type != "choice-color")
					$(".selectMenuTalRasha .selected td").eq(1).html(`<b>< </b>${value}<b> ></b>`);
				else {
					$(".selectMenuTalRasha .selected .color-td").html(`<b>< </b><div></div><b> ></b>`);
					$(".selectMenuTalRasha .selected div").css("background", value);
				}

				mp.trigger(`selectMenu.itemValueChanged`, currentMenu.name, items[itemIndex].text, value, itemIndex, valueIndex - 1);
			} else if (e.keyCode == 39) { //right
				var items = currentMenu.items;
				var itemIndex = $(".selectMenuTalRasha .selected").data("index");
				if (!items[itemIndex].values) return;

				var valueIndex = items[itemIndex].valueIndex || 0;
				if (valueIndex >= items[itemIndex].values.length - 1)
					return;

				value = items[itemIndex].values[valueIndex + 1];
				items[itemIndex].valueIndex = valueIndex + 1;
				if (items[itemIndex].type != "choice-color")
					$(".selectMenuTalRasha .selected td").eq(1).html(`<b>< </b>${value}<b> ></b>`);
				else {
					$(".selectMenuTalRasha .selected .color-td").html(`<b>< </b><div></div><b> ></b>`);
					$(".selectMenuTalRasha .selected div").css("background", value);
				}

				mp.trigger(`selectMenu.itemValueChanged`, currentMenu.name, items[itemIndex].text, value, itemIndex, valueIndex + 1);
			} else if (e.keyCode == 13) { //enter
				var items = currentMenu.items;
				var itemIndex = $(".selectMenuTalRasha .selected").data("index");
				var itemValue = null;
				if (items[itemIndex].valueIndex == null && items[itemIndex].values) items[itemIndex].valueIndex = 0;
				var valueIndex = (items[itemIndex].valueIndex == null) ? -1 : items[itemIndex].valueIndex;
				if (valueIndex != -1 && items[itemIndex].values) itemValue = items[itemIndex].values[valueIndex];
				if (itemSelectedHandlers[currentMenu.name]) return itemSelectedHandlers[currentMenu.name](items[itemIndex - 1].text, items[itemIndex].text, itemValue, itemIndex);
				mp.trigger(`selectMenu.itemSelected`, currentMenu.name, JSON.stringify(items[itemIndex]), itemValue, itemIndex);
			} else if (e.keyCode == 8) { //backspace
				var items = currentMenu.items;
				var itemIndex = $(".selectMenuTalRasha .selected").data("index");
				var itemValue = null;
				var valueIndex = items[itemIndex].valueIndex || -1;
				if (valueIndex != -1) itemValue = items[itemIndex].values[valueIndex];

				mp.trigger(`selectMenu.backspacePressed`, currentMenu.name, items[itemIndex].text, itemValue, itemIndex);
			} else if (e.keyCode == 27) { //ESC
				$(`.selectMenu`).hide();
				setCursor(false);
			}
		},
		getValue: (menuName, itemName) => {
			if (!menus[menuName]) return name;
			var items = menus[menuName].items;
			for (var i = 0; i < items.length; i++)
				if (items[i].text == itemName) return items[i].value;

			return null;
		},
	};
	
	selectMenuAPITalRasha.init();
	
	/*function menuTransition(event) {
        if (event.keyCode == 38) { // вверх
            let index = $(".selectMenu .content .block_list").index($("div.block_list.active"))
            if (index - 1 == -1)
                return
            index -= 1
            $(`.selectMenu .content .block_list`).removeClass("active")
            $(`.selectMenu .content .block_list:nth-child(${index + 1})`).addClass("active")
        }
        if (event.keyCode == 40) { // вниз
            let index = $(".selectMenu .content .block_list").index($("div.block_list.active"))
            if (index + 1 > $(".selectMenu .content .block_list").length - 1)
                return
            index += 1
            $(`.selectMenu .content .block_list`).removeClass("active")
            $(`.selectMenu .content .block_list:nth-child(${index + 1})`).addClass("active")
        }
        if (event.keyCode == 13) {
            var items = currentMenu.items;
            var itemIndex = $(".selectMenu .block_list.active").data("index");
            var itemValue = null;
            if (items[itemIndex].valueIndex == null && items[itemIndex].values)
                items[itemIndex].valueIndex = 0;
            var valueIndex = (items[itemIndex].valueIndex == null) ? -1 : items[itemIndex].valueIndex;
            if (valueIndex != -1 && items[itemIndex].values)
                itemValue = items[itemIndex].values[valueIndex];
            if (itemSelectedHandlers[currentMenu.name])
                return itemSelectedHandlers[currentMenu.name](items[itemIndex - 1].text, items[itemIndex].text, itemValue, itemIndex);
            console.log("currentMenu.name", currentMenu.name)
            console.log("items[itemIndex]", items[itemIndex])
            console.log("itemIndex", itemIndex)
            console.log("itemValue", itemValue)
            mp.trigger(`selectMenu.itemSelected`, currentMenu.name, JSON.stringify(items[itemIndex]).text, itemValue, itemIndex);
            console.log($('.selectMenu').find('.block_list.active').text())
        }
    }*/
});
